app/views/carts/_address_info.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", 1]]
---
<% address = Address.find_by_id session[:address_id] %>