app/controllers/addresses_controller.rb

  def create
    @address = Address.create(address_params)

    if users_params
      @user = @address.build_user(users_params)
      @user.update_attribute(:is_admin, false)

      respond_to do |format|
        if @address.save && @user.save
---
INSERT INTO "addresses" ("first_name", "last_name", "street", "number", "commune", "phone_number", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "users" ("password_digest", "address_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["password_digest", "$2a$10$d5pB7Ff1vEuT7d.ufcbpO.rej31KERBWzw0azj/qEWez.MasjBWbi"], ["address_id", 1], ["created_at", "2016-07-16 04:54:32.122324"], ["updated_at", "2016-07-16 04:54:32.122324"]]

    def set_address
      @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", 1]]