app/controllers/carts_controller.rb

  def show
    @order_items = current_order.order_items
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]

  def confirmation
    @order_items = current_order.order_items
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]

  def confirm
    current_order.update_attribute(:confirmed, true)
---
UPDATE "orders" SET "confirmed" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["confirmed", "t"], ["updated_at", "2016-07-16 04:55:13.357119"], ["id", 1]]

  def set_address
    @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", 1]]