app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "unit_price", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["quantity", 1], ["product_id", 1], ["order_id", 1], ["unit_price", 1000], ["total_price", 1000], ["created_at", "2016-07-16 04:55:05.182929"], ["updated_at", "2016-07-16 04:55:05.182929"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["subtotal", 1000], ["created_at", "2016-07-16 04:55:05.180839"], ["updated_at", "2016-07-16 04:55:05.180839"]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @order = current_order
    @order_item = @order.order_items.build(order_item_params)
    @order.save

    @package = Package.find_by_id @order_item.package_id