app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "description", "picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    @product.update_attribute(:active, true)

    respond_to do |format|
      if @product.save