app/controllers/sessions_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."email" = $1 LIMIT 1  [["email", "efmino@uc.cl"]]
---
  def create
    address = Address.find_by(email: params[:session][:email].downcase)